### Importar a lib pandas e o arquivo titanic:

In [4]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Idade dos passageiros do Titanic:

In [5]:
ages = titanic["Age"]
ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

### DataFrame.shape 
<i>É um atributo que exibe o número de linhas e colunas.</i><br>
<i>No caso de uso titanic["Age"].shape, exibe apenas o número de linhas, porque uma Series é unidimensional.</i>

In [6]:
titanic["Age"].shape

(891,)

### Pegando a idade e o sexo dos passageiros:
<i>Para selecionar várias colunas, basta usar uma lista python dentro dos colchetes de seleção.</i><br>
<i>Portanto, o par de colchetes internos define a lista, e o par externo são usados para selecionar dados em um DataFrame </i>

In [7]:
age_sex = titanic[["Age", "Sex"]]

In [8]:
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

### O tipo de dados retornado é um DataFrame pandas.

In [9]:
type(titanic[["Age", "Sex"]])

pandas.core.frame.DataFrame

### Exibindo o número de linhas e colunas:

In [10]:
titanic[["Age", "Sex"]].shape

(891, 2)

### Filtrando passageiros com mais de 35 anos.
<i>Para selecionar linhas com base em uma expressão condicional, deve-se usar a condição dentro dos colchetes da seleção. </i>

In [11]:
above_35 = titanic[titanic["Age"] > 35]

In [12]:
above_35.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

<i>A condição dentro dos colchetes de seleção verifica para quais linhas a coluna tem um valor maior que 35</i>

In [13]:
titanic["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

### O número de linhas que satisfazem a condição > 35 anos.

In [14]:
above_35.shape

(217, 12)

### Passageiros do Titanic das classes de cabine 2 e 3.
<i>Semelhante à expressão condicional, a função condicional isin() retorna um True para cada linha em que os valores estão na lista fornecida. Para filtrar as linhas com base nessa função, use a função condicional dentro dos colchetes de seleção []. Nesse caso, a condição dentro dos colchetes de seleção verifica para quais linhas a coluna é 2 ou 3.</i>

In [15]:
class_23 = titanic[titanic["Pclass"].isin([2, 3])]

In [16]:
class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

### Equivalente ao que é feito acima, porém usando duas expressões com o operador or |.
<i>Ao combinar várias instruções condicionais, cada condição deve estar entre parênteses (). Além disso, você não pode usar **or** ou **and**, precisa usar o operador **|** e o operador **&**.</i>

In [17]:
class_23 = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)]

In [18]:
class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

### Passageiros com idade conhecida.
<i>A função condicional **notna()** retorna um True para cada linha em que os valores não são nulos. Como tal, isso pode ser combinado com os colchetes de seleção [] para filtrar a tabela de dados.</i>

In [19]:
age_no_na = titanic[titanic["Age"].notna()]

In [20]:
age_no_na.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<i>Mesmo que as 5 primeiras linhas sejam iguais as anteriores, com o shape podemos ver que mudou a quantidade de linhas.</i>

In [21]:
age_no_na.shape

(714, 12)

### Selecionando os nomes dos passageiros com mais de 35 anos.
<i>Nesse caso, um subconjunto de linhas e colunas é feito de uma só vez e apenas usar colchetes [ ] de seleção não é mais suficiente. Os operadores **loc/iloc** são necessários na frente dos colchetes [ ] de seleção. Ao usar loc/iloc, a parte antes da vírgula são as linhas que você deseja e a parte após a vírgula são as colunas que você deseja selecionar.

Ao usar os nomes de coluna, rótulos de linha ou uma expressão de condição, use o operador loc na frente dos colchetes [ ] de seleção. Para a parte antes e depois da vírgula, você pode usar um único rótulo, uma lista de rótulos, uma fatia de rótulos, uma expressão condicional ou dois pontos. O uso de dois pontos especifica que você deseja selecionar todas as linhas ou colunas.</i>

In [26]:
adult_names = titanic.loc[titanic["Age"] > 35, "Name"]

In [27]:
adult_names.head()

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
6                               McCarthy, Mr. Timothy J
11                             Bonnell, Miss. Elizabeth
13                          Andersson, Mr. Anders Johan
15                     Hewlett, Mrs. (Mary D Kingcome)
Name: Name, dtype: object

### Selecionando as linhas: de 10 a 25 e colunas de 3 a 5. 
<i>Para selecionar linhas e colunas com base na sua posição da tabela, usar o operador iloc na frente dos colchetes [ ] de seleção.</i>

In [30]:
titanic.iloc[9:25, 2:5]

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

### Atribuindo novos valores aos 3 primeiros elementos da terceira coluna.

In [31]:
titanic.iloc[0:3, 3] = "anonymous"

In [32]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,anonymous,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,anonymous,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,anonymous,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### LEMBRAR:

- Ao selecionar subconjuntos de dados, colchetes [ ] são usados.

- Dentro desses colchetes, você pode usar um único rótulo de coluna/linha, uma lista de rótulos de coluna/linha, uma fatia de rótulos, uma expressão condicional ou dois pontos.

- Selecione linhas e/ou colunas específicas usando loc ao usar os nomes de linha e coluna

- Selecione linhas e/ou colunas específicas usando iloc ao usar as posições na tabela

- Você pode atribuir novos valores a uma seleção com base em loc/iloc.